Revit 2024 API
ParameterValue Class
 A class that holds a value of a parameter element.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2016 Subscription Update
Syntax
C#
public class ParameterValue : IDisposable
Visual Basic
Public Class ParameterValue _
	Implements IDisposable
Visual C++
public ref class ParameterValue : IDisposable
Remarks
 This is a non-instantiable base class. Classes that actually store a value of a certain type are all derived from this base class, once class per each value type.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.ParameterValue
 Autodesk.Revit.DB.DoubleParameterValue
 Autodesk.Revit.DB.ElementIdParameterValue
 Autodesk.Revit.DB.IntegerParameterValue
 Autodesk.Revit.DB.NullParameterValue
 Autodesk.Revit.DB.StringParameterValue
See Also
ParameterValue Members
Autodesk.Revit.DB Namespace